iter3/user-stress-tests/test-user-stress-v2-report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 58393,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.8780847019334419,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 63.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 97.50855806963347,
    "receivedKBytesPerSec" : 82.08239946877347,
    "sentKBytesPerSec" : 10.760221740106036
  },
  "HTTP Request" : {
    "transaction" : "HTTP Request",
    "sampleCount" : 58393,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.8780847019334419,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 63.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 97.50855806963347,
    "receivedKBytesPerSec" : 82.08239946877347,
    "sentKBytesPerSec" : 10.760221740106036
  }
}